---
kind: property
id: P:Autodesk.Revit.DB.ExportLinetypeKey.OriginalLinetypeName
source: html/b81836ad-8092-1525-f9c9-5143f067c6b6.htm
---
# Autodesk.Revit.DB.ExportLinetypeKey.OriginalLinetypeName Property

The original linetype name.

## Syntax (C#)
```csharp
public string OriginalLinetypeName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null